/*
Барьерная синхронизация - метод синхронизации в распределенных
вычислениях (Распределённые вычисления — способ решения трудоёмких 
вычислительных задач с использованием нескольких компьютеров, 
чаще всего объединённых в параллельную вычислительную систему),
при котором выполнение параллельного алгоритма или его части 
можно разделить на несколько этапов, разделённых барьерами
Барьер для группы потоков (или процессов) в исходном коде означает, 
что каждый поток (процесс) должен остановиться в этой точке и 
подождать достижения барьера всеми потоками (процессами) группы. 
Когда все потоки (процессы) достигли барьера, их выполнение продолжается
*/